ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_pdm_pcm.h
#include "cy_device.h"
#include "cy_device_headers.h"
#include "cy_syslib.h"
#include "cy_syspm.h"
#include <stddef.h>
#include <stdbool.h>

#ifdef CY_IP_MXAUDIOSS

#ifdef __cplusplus
extern "C"
{
#endif

/******************************************************************************
 * Global definitions
 ******************************************************************************/

/* Macros */
/**
* \addtogroup group_pdm_pcm_macros
* \{
*/

/** The driver major version */
#define CY_PDM_PCM_DRV_VERSION_MAJOR       2

/** The driver minor version */
#define CY_PDM_PCM_DRV_VERSION_MINOR       20

/** The PDM-PCM driver identifier */
#define CY_PDM_PCM_ID                       CY_PDL_DRV_ID(0x26u)

/**
* \defgroup group_pdm_pcm_macros_interrupt_masks Interrupt Masks
* \{
*/

/** Bit 16: More entries in the RX FIFO than specified by Trigger Level. */
#define CY_PDM_PCM_INTR_RX_TRIGGER         (PDM_INTR_RX_TRIGGER_Msk)
/** Bit 18: RX FIFO is not empty. */
#define CY_PDM_PCM_INTR_RX_NOT_EMPTY       (PDM_INTR_RX_NOT_EMPTY_Msk)
/** Bit 21: Attempt to write to a full RX FIFO. */
#define CY_PDM_PCM_INTR_RX_OVERFLOW        (PDM_INTR_RX_OVERFLOW_Msk)
/** Bit 22: Attempt to read from an empty RX FIFO. */
#define CY_PDM_PCM_INTR_RX_UNDERFLOW       (PDM_INTR_RX_UNDERFLOW_Msk)

/** \} group_pdm_pcm_macros_interrupt_masks */

/** \} group_pdm_pcm_macros */

/**
* \addtogroup group_pdm_pcm_enums
* \{
*/

/** PDM Word Length. */
typedef enum
{
    CY_PDM_PCM_WLEN_16_BIT     = 0U,         /**< Word length: 16 bit. */
    CY_PDM_PCM_WLEN_18_BIT     = 1U,         /**< Word length: 18 bit. */
    CY_PDM_PCM_WLEN_20_BIT     = 2U,         /**< Word length: 20 bit. */
    CY_PDM_PCM_WLEN_24_BIT     = 3U          /**< Word length: 24 bit. */
} cy_en_pdm_pcm_word_len_t;

/** PDM Clock Divider. */
typedef enum
{
    CY_PDM_PCM_CLK_DIV_BYPASS  = 0U,         /**< Clock 1/1. */
    CY_PDM_PCM_CLK_DIV_1_2     = 1U,         /**< Clock 1/2 (no 50% duty cycle). */
    CY_PDM_PCM_CLK_DIV_1_3     = 2U,         /**< Clock 1/3 (no 50% duty cycle). */
    CY_PDM_PCM_CLK_DIV_1_4     = 3U          /**< Clock 1/4 (no 50% duty cycle). */
} cy_en_pdm_pcm_clk_div_t;

/** PDM Output Mode. */
typedef enum
{
    CY_PDM_PCM_OUT_CHAN_LEFT   = 1U,         /**< Channel mono left. */
    CY_PDM_PCM_OUT_CHAN_RIGHT  = 2U,         /**< Channel mono right. */
    CY_PDM_PCM_OUT_STEREO      = 3U          /**< Channel stereo. */
} cy_en_pdm_pcm_out_t;

/** PDM Channel selector. */
typedef enum
{
    CY_PDM_PCM_CHAN_LEFT       = 0U,         /**< Channel left. */
    CY_PDM_PCM_CHAN_RIGHT      = 1U          /**< Channel right. */
} cy_en_pdm_pcm_chan_select_t;

/** PDM Gain. */
typedef enum
{
    CY_PDM_PCM_ATTN_12_DB      = 0U,         /**< -12 dB (attenuation). */
    CY_PDM_PCM_ATTN_10_5_DB    = 1U,         /**< -10.5 dB (attenuation). */
    CY_PDM_PCM_ATTN_9_DB       = 2U,         /**< -9 dB (attenuation). */
    CY_PDM_PCM_ATTN_7_5_DB     = 3U,         /**< -7.5 dB (attenuation). */
    CY_PDM_PCM_ATTN_6_DB       = 4U,         /**< -6 dB (attenuation). */
    CY_PDM_PCM_ATTN_4_5_DB     = 5U,         /**< -4.5 dB (attenuation). */
    CY_PDM_PCM_ATTN_3_DB       = 6U,         /**< -3 dB (attenuation). */
    CY_PDM_PCM_ATTN_1_5_DB     = 7U,         /**< -1.5 dB (attenuation). */
    CY_PDM_PCM_BYPASS          = 8U,         /**< 0 dB (bypass). */
    CY_PDM_PCM_GAIN_1_5_DB     = 9U,         /**< +1.5 dB (amplification). */
    CY_PDM_PCM_GAIN_3_DB       = 10U,        /**< +3 dB (amplification). */
    CY_PDM_PCM_GAIN_4_5_DB     = 11U,        /**< +4.5 dB (amplification). */
    CY_PDM_PCM_GAIN_6_DB       = 12U,        /**< +6 dB (amplification). */
    CY_PDM_PCM_GAIN_7_5_DB     = 13U,        /**< +7.5 dB (amplification). */
    CY_PDM_PCM_GAIN_9_DB       = 14U,        /**< +9 dB (amplification). */
    CY_PDM_PCM_GAIN_10_5_DB    = 15U         /**< +10.5 dB (amplification). */
} cy_en_pdm_pcm_gain_t;


/** The time step for gain change during PGA or soft mute operation in
 *  number of 1/a sampling rate. */
typedef enum
{
    CY_PDM_PCM_SOFT_MUTE_CYCLES_64  = 0U,    /**< 64 steps. */
    CY_PDM_PCM_SOFT_MUTE_CYCLES_96  = 1U,    /**< 96 steps. */
    CY_PDM_PCM_SOFT_MUTE_CYCLES_128 = 2U,    /**< 128 steps. */
    CY_PDM_PCM_SOFT_MUTE_CYCLES_160 = 3U,    /**< 160 steps. */
    CY_PDM_PCM_SOFT_MUTE_CYCLES_192 = 4U,    /**< 192 steps. */
    CY_PDM_PCM_SOFT_MUTE_CYCLES_256 = 5U,    /**< 256 steps. */
    CY_PDM_PCM_SOFT_MUTE_CYCLES_384 = 6U,    /**< 384 steps. */
    CY_PDM_PCM_SOFT_MUTE_CYCLES_512 = 7U     /**< 512 steps. */
} cy_en_pdm_pcm_s_cycles_t;

/** The PDM-PCM status codes. */
typedef enum
{
    CY_PDM_PCM_SUCCESS         = 0x00UL,    /**< Success status code */
    CY_PDM_PCM_BAD_PARAM       = CY_PDM_PCM_ID | CY_PDL_STATUS_ERROR | 0x01UL /**< Bad parameter status code */
} cy_en_pdm_pcm_status_t;

/** \} group_pdm_pcm_enums */


/**
* \addtogroup group_pdm_pcm_data_structures
* \{
*/

/******************************************************************************
 * Global type definitions
 ******************************************************************************/

/** PDM-PCM initialization configuration */
typedef struct
{
    cy_en_pdm_pcm_clk_div_t  clkDiv;              /**< PDM Clock Divider (1st divider), see #cy_en_pdm_pcm_clk_div_t
                                                    This configures a frequency of PDM CLK. The configured frequency
                                                    is used to operate PDM core. I.e. the frequency is input to
                                                    MCLKQ_CLOCK_DIV register. */
    cy_en_pdm_pcm_clk_div_t  mclkDiv;             /**< MCLKQ divider (2nd divider), see #cy_en_pdm_pcm_clk_div_t */
    uint8_t                  ckoDiv;              /**< PDM CKO (FPDM_CKO) clock divider (3rd divider):
                                                    - if CKO_CLOCK_DIV >= 1 - *F(PDM_CKO) = F(PDM_CLK / (mclkDiv + 1))
                                                    - if CKO_CLOCK_DIV  = 0 - *F(PDM_CKO) = MCLKQ / 2 */
    uint8_t                  ckoDelay;            /**< Extra PDM_CKO delay to internal sampler:
                                                    - 0: Three extra PDM_CLK period advance
                                                    - 1: Two extra PDM_CLK period advance
                                                    - 2: One extra PDM_CLK period advance
                                                    - 3: No delay
                                                    - 4: One extra PDM_CLK period delay
                                                    - 5: Two extra PDM_CLK period delay
                                                    - 6: Three extra PDM_CLK period delay
                                                    - 7: Four extra PDM_CLK clock delay */
    uint8_t                  sincDecRate;         /**< F(MCLK_L_R) = Fs * 2 * sincDecRate * mclkDiv,
                                                    Fs is a sampling frequency, 8 kHz - 48 kHz */
    cy_en_pdm_pcm_out_t      chanSelect;          /**< see #cy_en_pdm_pcm_out_t */
    bool                     chanSwapEnable;      /**< Audio channels swapping */
    uint8_t                  highPassFilterGain;  /**< High pass filter gain:
                                                    H(Z) = (1 - Z^-1) / (1 - (1 - 2^highPassFilterGain) * Z^-1) */
    bool                     highPassDisable;     /**< High pass filter disable */
    cy_en_pdm_pcm_s_cycles_t softMuteCycles;      /**< The time step for gain change during PGA or soft mute operation in
                                                    number of 1/a sampling rate, see #cy_en_pdm_pcm_s_cycles_t. */
    uint32_t                 softMuteFineGain;    /**< Soft mute fine gain: 0 = 0.13dB, 1 = 0.26dB */
    bool                     softMuteEnable;      /**< Soft mute enable */
    cy_en_pdm_pcm_word_len_t wordLen;             /**< see #cy_en_pdm_pcm_word_len_t */
    bool                     signExtension;       /**< Word extension type:
                                                    - 0: extension by zero
                                                    - 1: extension by sign bits */
    cy_en_pdm_pcm_gain_t     gainLeft;            /**< Gain for left channel, see #cy_en_pdm_pcm_gain_t */
    cy_en_pdm_pcm_gain_t     gainRight;           /**< Gain for right channel, see #cy_en_pdm_pcm_gain_t */
    uint8_t                  rxFifoTriggerLevel;  /**< Fifo interrupt trigger level (in words), 
                                                    range: 0 - 253 for stereo and 0 - 254 for mono mode */
    bool                     dmaTriggerEnable;    /**< DMA trigger enable */
    uint32_t                 interruptMask;       /**< Interrupts enable mask */
} cy_stc_pdm_pcm_config_t;

